Revit 2026 API

# ThermalAssetReflectivity Property

---

The reflectivity of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Reflectivity { get; set; }
```
```vb
Public Property Reflectivity As Double
	Get
	Set
```
```cpp
public:
property double Reflectivity {
	double get ();
	void set (double value);
}
```
```fsharp
member Reflectivity : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for reflectivity is out of range |

Values must be in the range 0 to 1.

#### Reference

ThermalAsset Class

Autodesk.Revit.DB Namespace